In [2]:
import pandas as pd 
from pandas import Series, DataFrame

obj = Series([3,7,-5,3])
obj

0    3
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
onj=Series([4,7,-5,3],index = ["d", "b", "a","c"])
onj.index[0]

'd'

In [9]:
onj.index[1]

'b'

In [10]:
onj[["d", "a", "c"]]

d    4
a   -5
c    3
dtype: int64

In [11]:
onj[onj>2]

d    4
b    7
c    3
dtype: int64

In [12]:
onj*2

d     8
b    14
a   -10
c     6
dtype: int64

In [14]:
import numpy as np
np.exp(onj)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [23]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}
obj3= Series(sdata)

In [19]:
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [21]:
states = ["California","Ohio","Oregon","Texas"]
obj4 = Series(sdata,index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [22]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [24]:
obj4 + obj3

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [26]:
obj4.name = "population"
obj4.index.name = "state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [27]:
obj4.rename("people")

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: people, dtype: float64

In [29]:
data = {'state':['ohio','ohio','ohio','Nevada','Nevada'],'year':[2000,2201,2002,2002,2002],'pop':[1.5,1.7,3.6,2.4,2.9]}

In [55]:
import pandas as pd
from pandas import Series, DataFrame

frame = DataFrame(data)
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2201  1.7
2    ohio  2002  3.6
3  Nevada  2002  2.4
4  Nevada  2002  2.9

In [32]:
DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    ohio  1.5
1  2201    ohio  1.7
2  2002    ohio  3.6
3  2002  Nevada  2.4
4  2002  Nevada  2.9

In [56]:
frame2 = DataFrame(data,columns=['year','state','pop','debt'], index = ['one','two','three','four','five'])
frame2

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2201    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2002  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [36]:
frame2['state']

one        ohio
two        ohio
three      ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [37]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [38]:
frame2['year']

one      2000
two      2201
three    2002
four     2002
five     2002
Name: year, dtype: int64

In [40]:
frame2['debt']=16.7
frame2

       year   state  pop  debt
one    2000    ohio  1.5  16.7
two    2201    ohio  1.7  16.7
three  2002    ohio  3.6  16.7
four   2002  Nevada  2.4  16.7
five   2002  Nevada  2.9  16.7

In [57]:
frame2["debt"]=np.arange(5)
frame2

       year   state  pop  debt
one    2000    ohio  1.5     0
two    2201    ohio  1.7     1
three  2002    ohio  3.6     2
four   2002  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [43]:
val = Series([-1.2,-1.5,-1.7], index = ['two','four','five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [44]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5     0
two    2201    ohio  1.7     1
three  2002    ohio  3.6     2
four   2002  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [58]:
frame2["debt"]= val
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2201    ohio  1.7  -1.2
three  2002    ohio  3.6   NaN
four   2002  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [65]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    ohio  1.5   NaN    False
two    2201    ohio  1.7  -1.2    False
three  2002    ohio  3.6   NaN    False
four   2002  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [66]:
del frame2["eastern"]

In [67]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2201    ohio  1.7  -1.2
three  2002    ohio  3.6   NaN
four   2002  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [68]:
pop = {'Nevada': {2001:2.4, 2002: 2.9}, 'Ohio':{2000:1.5, 2001:1.7, 2002: 3.6}}

In [70]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [71]:
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64')

In [72]:
DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [73]:
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64')

In [75]:
frame3.index.name
frame3.index.name = "year";frame3.columns.name="state"

In [76]:
frame3.index.name

'year'

In [77]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [81]:
d = {'one' : pd.Series([1.,2.,3.],index = ['a','b','c']),'two':pd.Series([1.,2.,3.,4.],index= ['a','b','c','d'])}
d

{'one': a    1.0
 b    2.0
 c    3.0
 dtype: float64, 'two': a    1.0
 b    2.0
 c    3.0
 d    4.0
 dtype: float64}

In [83]:
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [84]:
pd.DataFrame(d, index = ['d','b','a'],columns = ['two','three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [87]:
data2 = [{'a': 1, 'b':2},{'a':5,'b':10,'c':20}]
data2

[{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]

In [92]:
data2[0]["a"]

1

In [93]:
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [95]:
data2 = [{'a': 1, 'b':2},{'a':5,'b':10,'c':20},{'a':51,'d':30}]
pd.DataFrame(data2)

    a     b     c     d
0   1   2.0   NaN   NaN
1   5  10.0  20.0   NaN
2  51   NaN   NaN  30.0

In [98]:
obj = Series(range(3),index=["a", "b", "c"])
obj

a    0
b    1
c    2
dtype: int64

In [99]:
index = obj.index

In [100]:
index

Index(['a', 'b', 'c'], dtype='object')

In [101]:
index[1:]

Index(['b', 'c'], dtype='object')

In [102]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [104]:
"Ohio" in frame3.columns

True

In [105]:
2003 in frame3.index

False

In [106]:
obj

a    0
b    1
c    2
dtype: int64

In [110]:
obj = Series([4.5,7.2,6.5,-3.4], index = ['d','b','a','c'])
obj

d    4.5
b    7.2
a    6.5
c   -3.4
dtype: float64

In [109]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a    6.5
b    7.2
c   -3.4
d    4.5
e    NaN
dtype: float64

In [111]:
obj.reindex(['a','b','c','d','e'], fill_value=0)

a    6.5
b    7.2
c   -3.4
d    4.5
e    0.0
dtype: float64

In [114]:
obj3 = Series(['blue', 'purple', 'yellow'],index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [122]:
frame = DataFrame(np.arange(9).reshape((3, 3)),index = ['a','c','d'],columns = ['Ohio','Texas','California'])

In [123]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [126]:
frame.reindex(['a','b','c','d'])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [127]:
frame.reindex(columns=['Texas','Utah','California'])

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [128]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [130]:
states=['Texas','Utah','California']

In [131]:
frame.reindex(index=['a','b','c','d'],columns=states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [132]:
data = DataFrame(np.arange(16).reshape(4,4),index=['Ohio','Colorado','New York','Utah'],columns=['one','two','three','four'])

In [133]:
data.drop(["Colorado",'Utah'])

          one  two  three  four
Ohio        0    1      2     3
New York    8    9     10    11

In [134]:
data.drop("two",axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
New York    8     10    11
Utah       12     14    15

In [135]:
data.drop(["two","four"],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
New York    8     10
Utah       12     14

In [136]:
obj = Series(np.arange(4.),index = ['a','b','c','d'])

In [137]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [138]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [139]:
obj[["b","c","a"]]

b    1.0
c    2.0
a    0.0
dtype: float64

In [140]:
obj['b':'c'] = 5

In [141]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [156]:
data = DataFrame(np.arange(16).reshape(4,4),index=['Ohio','Colorado','New York','Utah'],columns=['one','two','three','four'])

In [143]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11
Utah       12   13     14    15

In [144]:
data["two"]

Ohio         1
Colorado     5
New York     9
Utah        13
Name: two, dtype: int32

In [145]:
data[["four","one"]]

          four  one
Ohio         3    0
Colorado     7    4
New York    11    8
Utah        15   12

In [146]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [147]:
data[data["three"]>5]

          one  two  three  four
Colorado    4    5      6     7
New York    8    9     10    11
Utah       12   13     14    15

In [148]:
data >5

            one    two  three   four
Ohio      False  False  False  False
Colorado  False  False   True   True
New York   True   True   True   True
Utah       True   True   True   True

In [151]:
data[data<5]=0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
New York    8    9     10    11
Utah       12   13     14    15

In [159]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [158]:
data.loc[:"Utah","two":]

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
New York    9     10    11
Utah       13     14    15

In [157]:
data.loc[:"Utah"]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11
Utah       12   13     14    15

In [161]:
data.loc[:,data.loc["Ohio"]>1]

          three  four
Ohio          2     3
Colorado      6     7
New York     10    11
Utah         14    15

In [162]:
data.three > 5

Ohio        False
Colorado     True
New York     True
Utah         True
Name: three, dtype: bool

In [163]:
data.loc["Ohio"]>1

one      False
two      False
three     True
four      True
Name: Ohio, dtype: bool

In [164]:
data.loc[data.three > 5, :]

          one  two  three  four
Colorado    4    5      6     7
New York    8    9     10    11
Utah       12   13     14    15